-- phpMyAdmin SQL Dump
-- version 4.0.4
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2018 年 09 月 21 日 14:34
-- 服务器版本: 5.6.12-log
-- PHP 版本: 5.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `shopjd`
--

-- --------------------------------------------------------

--
-- 表的结构 `jd_pro`
--

CREATE TABLE IF NOT EXISTS `jd_pro` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `cId` smallint(5) unsigned NOT NULL,
  `pName` varchar(50) NOT NULL,
  `pSn` varchar(50) NOT NULL,
  `inventory` int(10) unsigned DEFAULT '1',
  `isreplesh` varchar(20) DEFAULT '商品不需要补货',
  `cPrice` decimal(10,2) NOT NULL,
  `mPrice` decimal(10,2) NOT NULL,
  `dicprice` decimal(10,2) NOT NULL,
  `pDesc` text,
  `pImg` varchar(50) NOT NULL,
  `pubTime` int(10) unsigned NOT NULL,
  `isShow` tinyint(1) DEFAULT '1',
  `isHot` tinyint(1) DEFAULT '0',
  `color1` varchar(18) DEFAULT NULL,
  `color2` varchar(18) DEFAULT NULL,
  `color3` varchar(18) DEFAULT NULL,
  `color4` varchar(18) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `pName` (`pName`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 AUTO_INCREMENT=39 ;

--
-- 转存表中的数据 `jd_pro`
--

INSERT INTO `jd_pro` (`id`, `cId`, `pName`, `pSn`, `inventory`, `isreplesh`, `cPrice`, `mPrice`, `dicprice`, `pDesc`, `pImg`, `pubTime`, `isShow`, `isHot`, `color1`, `color2`, `color3`, `color4`) VALUES
(19, 1, '◆ANNA◆气质立领腰带手工双面羊毛呢子大衣过膝中长款外套女', 'A1', 98, '商品不需要补货', '100.00', '180.00', '0.90', '风格: 通勤    通勤: 简约    衣长: 长款<br />\r\n袖长: 长袖    领子: 立领    袖型: 插肩袖<br />\r\n衣门襟: 系带   面料材质: 羊毛  面料主材质含量: 95%及以上<br />\r\n适用年龄: 25-29周岁           上市年份季节: 2017年冬季<br />\r\n颜色分类: 绿色-现货 黑色-现货 混白色-现货     ', '', 1536848265, 1, 0, '绿色-现货', '黑色-现货', '混白色-现货', ''),
(20, 1, '018秋冬新款流行花色羊毛呢子大衣女中长款宽松复古格子毛呢外套', 'A2', 88, '商品不需要补货', '1000.00', '1700.00', '0.80', '品牌: CRELSS<br />\r\n衣长: 中长款<br />\r\n袖长: 长袖<br />\r\n袖型: 常规<br />\r\n衣门襟: 暗扣<br />\r\n图案: 格子<br />\r\n面料材质: 羊毛<br />\r\n面料主材质含量: 31%(含)-50%(含)<br />\r\n上市年份季节: 2018年秋季<br />\r\n颜色分类: 斑斓绿 红色<br />', '', 1536848532, 1, 0, '斑斓绿', '红色', '', ''),
(21, 8, '8.18missqiuqiu秋家自制毛衣＋短裙＋衬衫3件套樱花粉少女3件套', 'A4', 86, '商品不需要补货', '100.00', '169.00', '0.90', '服装版型: 宽松<br />\r\n厚薄: 常规<br />\r\n风格: 甜美<br />\r\n甜美: 学院<br />\r\n款式: 开衫<br />\r\n衣长: 中长款<br />\r\n领子: V领<br />\r\n图案: 纯色<br />\r\n成分含量: 91%(含)-95%(不含)<br />\r\n面料: 其他<br />\r\n上市年份/季节: 2018年秋季<br />\r\n颜色分类: 毛衣均码＋ 衬衫均码+&nbsp; 短裙xs码 毛衣均码＋衬衫均码＋短裙s码 毛衣均码＋衬衫均码＋短裙m码 毛衣均码＋衬衫均码＋短裙L码<br />', '', 1536848847, 1, 0, '毛衣均码＋ 衬衫均码+ 短裙均码', '', '', ''),
(22, 8, 'elielim短款针织开衫女秋冬装2018新款韩版长袖宽松百搭毛衣外套', 'A5', 92, '商品不需要补货', '150.00', '239.00', '0.80', '服装版型: 宽松<br />\r\n厚薄: 厚<br />\r\n风格: 通勤<br />\r\n通勤: 韩版<br />\r\n款式: 开衫<br />\r\n组合形式: 单件<br />\r\n衣长: 短款<br />\r\n袖长: 长袖<br />\r\n袖型: 常规<br />\r\n图案: 纯色<br />\r\n流行元素/工艺: 绑带<br />\r\n成分含量: 30%及以下<br />\r\n面料: 其他<br />\r\n上市年份/季节: 2018年秋季<br />\r\n颜色分类: 黑色预定15天 驼色预定15天 牛油果绿预定20天<br />', '', 1536849031, 1, 0, '黑色预定15天', '驼色预定15天', '牛油果绿预定20天', ''),
(23, 7, '8.18missqiuqiu秋家自制休闲口袋翻领口袋系扣长袖衬衫女', 'C1', 6, '商品不需要补货', '25.00', '55.00', '1.00', '风格: 甜美<br />\r\n甜美: 学院<br />\r\n衣长: 常规款<br />\r\n袖长: 长袖<br />\r\n袖型: 常规<br />\r\n领型: 其他<br />\r\n图案: 纯色<br />\r\n成分含量: 91%(含)-95%(含)<br />\r\n质地: 其他<br />\r\n年份季节: 2018年秋季<br />\r\n颜色分类: 烟雾蓝。 乳白。 淡粉。<br />', '', 1536849215, 1, 0, '烟雾蓝', '乳白', '淡粉', ''),
(24, 7, 'ByYou秋季性感气质绑带收腰灯笼袖v领雪纺衫女宽松洋气衬衫上衣', 'C2', 94, '商品不需要补货', '99.00', '158.00', '0.90', '成分含量: 81%(含)-90%(含)<br />\r\n袖长: 长袖<br />\r\n品牌: byyou<br />\r\n服装版型: 宽松<br />\r\n风格: 通勤<br />\r\n通勤: 韩版<br />\r\n穿着方式: 开衫<br />\r\n组合形式: 单件<br />\r\n衣长: 常规款<br />\r\n领型: V领<br />\r\n袖型: 灯笼袖<br />\r\n图案: 纯色<br />\r\n服装款式细节: 系带<br />\r\n适用年龄: 25-29周岁<br />\r\n年份季节: 2018年秋季<br />\r\n颜色分类: 奶咖色 白色<br />', '', 1536849349, 1, 0, '奶咖色', '白色', '', ''),
(25, 11, 'EXCELSIOR帆布鞋焦糖饼干复古休闲低帮情侣厚底小白鞋女020', 'F1', 87, '商品不需要补货', '100.00', '158.00', '0.90', '鞋制作工艺: 硫化工艺<br />\r\n品牌: other/其他<br />\r\n上市年份季节: 2017年春季<br />\r\n风格: 休闲<br />\r\n鞋底材质: 橡胶<br />\r\n鞋帮高度: 低帮<br />\r\n颜色分类: 限量暗红 限量粉红&nbsp; 限量黑白限量黄色&nbsp;限量白色&nbsp;<br />\r\n尺码: 35 36 37 38 39 40 41 42 43 44<br />\r\n适用对象: 青年（18-40周岁）<br />', '', 1537361302, 1, 0, '限量暗红', '限量粉红', '限量黄色', '限量白色'),
(26, 2, '[古怪舍]原创黑色和风高腰垂感阔腿裤女九分日系乱麻夏季薄款', 'A72', 94, '商品不需要补货', '60.00', '95.00', '1.00', '裤长: 九分裤<br />\r\n货号: A72<br />\r\n女裤裤型: 阔腿裤<br />\r\n女裤腰高: 高腰<br />\r\n风格: 原创<br />\r\n颜色分类: A72 乱麻裙裤<br />\r\n品牌: 古怪舍<br />\r\n尺寸: M码 L码 XL码<br />\r\n厚薄: 薄款<br />\r\n年份季节: 2018年夏季<br />\r\n<div>\r\n	<br />\r\n</div>', '', 1537362008, 1, 0, ' A72 乱麻裙裤', '', '', ''),
(27, 11, 'HOZ情侣平底高帮鞋女经典后街新品透气帆布鞋韩版学生休闲板鞋', 'JCAL32N83', 99, '商品不需要补货', '150.00', '259.00', '0.90', '鞋制作工艺: 硫化工艺<br />\r\n品牌: HOZ<br />\r\n货号: JCAL32N83<br />\r\n上市年份季节: 2016年春季<br />\r\n风格: 休闲<br />\r\n鞋底材质: 橡胶<br />\r\n鞋帮高度: 高帮<br />\r\n闭合方式: 系带<br />\r\n流行元素: 交叉绑带<br />\r\n颜色分类: 自然色 白色 红色 蓝色 黑色<br />\r\n尺码: 34 35 36 37 38 39 40 41 42 43 44<br />\r\n图案: 纯色<br />\r\n适用对象: 青年（18-40周岁）<br />\r\n<div>\r\n	<br />\r\n</div>', '', 1537497050, 1, 0, '自然色', '白色', '红色', '蓝色'),
(28, 11, '黑色复刻帆布鞋女学生韩版原宿风ulzzang百搭低帮板鞋港味鞋1970s', 'F2', 11, '商品不需要补货', '50.00', '108.00', '1.00', '鞋制作工艺: 硫化工艺<br />\r\n品牌: other/其他<br />\r\n上市年份季节: 2018年夏季<br />\r\n风格: 学院<br />\r\n鞋底材质: 橡胶<br />\r\n鞋帮高度: 低帮<br />\r\n闭合方式: 系带<br />\r\n颜色分类: 黑色<br />\r\n尺码: 35 36 37 38 39 40 41 42 43 44<br />\r\n图案: 纯色<br />\r\n适用对象: 青年（18-40周岁）<br />\r\n<div>\r\n	<br />\r\n</div>', '', 1537497153, 1, 0, '黑色', '', '', ''),
(30, 8, 'JHXC简约宽松V领套头针织衫女长袖2018秋季新款百搭韩版纯色毛衣', '2018.8.21', 99, '商品不需要补货', '99.00', '139.00', '0.80', '品牌: JHXC<br />\r\n服装版型: 直筒<br />\r\n货号: 2018.8.21<br />\r\n厚薄: 常规<br />\r\n风格: 通勤<br />\r\n通勤: 简约<br />\r\n款式: 套头<br />\r\n组合形式: 单件<br />\r\n衣长: 常规款<br />\r\n袖长: 长袖<br />\r\n领子: V领<br />\r\n袖型: 常规<br />\r\n衣门襟: 套头<br />\r\n图案: 纯色<br />\r\n流行元素/工艺: 破洞 螺纹<br />\r\n成分含量: 95%以上<br />\r\n面料: 其他<br />\r\n上市年份/季节: 2018年秋季<br />\r\n颜色分类: 卡其 驼色<br />\r\n尺码: M L<br />', '', 1537497507, 1, 0, '卡其', '驼色', '', ''),
(32, 1, 'ByYou秋冬新款气质系带驼色毛呢外套女中长款双面呢羊毛呢子大衣', 'M1', 99, '商品不需要补货', '200.00', '319.00', '0.70', '品牌: byyou<br />\r\n服装版型: 修身<br />\r\n风格: 通勤<br />\r\n通勤: 韩版<br />\r\n衣长: 中长款<br />\r\n袖长: 长袖<br />\r\n领子: POLO领<br />\r\n袖型: 常规<br />\r\n衣门襟: 其他<br />\r\n图案: 纯色<br />\r\n面料: 法兰绒<br />\r\n面料材质: 羊毛<br />\r\n面料主材质含量: 31%(含)-50%(含)<br />\r\n适用年龄: 25-29周岁<br />\r\n上市年份季节: 2018年冬季<br />\r\n颜色分类: 驼色<br />\r\n尺码: S M L<br />', '', 1537497778, 1, 0, '驼色', '', '', ''),
(34, 7, 'elielim蓝条纹衬衫女夏韩范2018早秋新品不规则裁剪宽松长袖衬衣', 'C2', 95, '商品不需要补货', '100.00', '159.00', '0.90', '风格: 百搭<br />\r\n衣长: 常规款<br />\r\n袖长: 长袖<br />\r\n袖型: 常规<br />\r\n领型: 西装领<br />\r\n衣门襟: 单排多扣<br />\r\n图案: 条纹<br />\r\n成分含量: 96%及以上<br />\r\n质地: 其他<br />\r\n年份季节: 2018年秋季<br />\r\n颜色分类: 现货 预定10天<br />\r\n尺码: XS S M<br />', '', 1537498023, 1, 1, '现货 预定10天', '', '', ''),
(36, 9, 'FLO定制男朋友的牛仔外套宽松廓形休闲时髦2018秋装新款女', 'FF133八月牛仔外套', 99, '商品不需要补货', '180.00', '229.00', '0.70', '风格: 百搭<br />\r\n货号: FF133八月牛仔外套<br />\r\n服装版型: 宽松<br />\r\n厚薄: 常规<br />\r\n组合形式: 单件<br />\r\n衣长: 常规<br />\r\n袖长: 长袖<br />\r\n领子: 立领<br />\r\n袖型: 蝙蝠袖<br />\r\n衣门襟: 单排扣<br />\r\n图案: 纯色<br />\r\n流行元素/工艺: 褶皱 口袋 扎染 做旧 纽扣<br />\r\n面料: 其他<br />\r\n成分含量: 96%及以上<br />\r\n适用年龄: 18-24周岁<br />\r\n年份季节: 2018年秋季<br />\r\n颜色分类: 牛仔蓝<br />\r\n尺码: 预定 XS S M<br />\r\n<div>\r\n	<br />\r\n</div>', '', 1537498287, 1, 1, '牛仔蓝', '', '', ''),
(37, 9, 'JHXC黑色宽松破洞牛仔外套秋季女2018新款韩版bf原宿风夹克上衣', '2018.8.21', 99, '商品不需要补货', '100.00', '185.00', '0.80', ' \r\n材质: 棉\r\n风格: 通勤\r\n货号: 2018.8.21\r\n服装版型: 宽松\r\n厚薄: 常规\r\n品牌: JHXC\r\n组合形式: 单件\r\n衣长: 常规\r\n袖长: 长袖\r\n领子: POLO领\r\n袖型: 常规\r\n衣门襟: 单排扣\r\n图案: 纯色\r\n流行元素/工艺: 破洞 口袋 做旧 纽扣 贴布\r\n面料: 棉\r\n成分含量: 96%及以上\r\n年份季节: 2018年秋季\r\n颜色分类: 黑色\r\n尺码: M L', '', 1537498343, 1, 0, '黑色', '', '', ''),
(38, 2, '2018新款春秋女装丝绒阔腿裤休闲裤子金丝绒系带拖地长裤黑色', 'K1', 99, '商品不需要补货', '100.00', '184.00', '0.70', '裤长: 长裤<br />\r\n女裤裤型: 阔腿裤<br />\r\n女裤腰高: 高腰<br />\r\n风格: 通勤<br />\r\n颜色分类: 黑色<br />\r\n尺寸: S M L<br />\r\n服装款式细节: 腰带<br />\r\n厚薄: 常规<br />\r\n年份季节: 2018年秋季<br />', '', 1537498512, 1, 0, '黑色', '', '', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
